{"meta":{"title":"小苹果牛角包","subtitle":"","description":"纯粹、热爱、勇敢","author":"小苹果牛角包","url":"http://example.com","root":"/"},"pages":[],"posts":[{"title":"","slug":"产品/20230413-过了两百天，谈谈 Microsoft Edge 浏览器开拓者大赛","date":"2023-08-31T14:00:13.915Z","updated":"2023-08-31T15:41:33.896Z","comments":true,"path":"2023/08/31/产品/20230413-过了两百天，谈谈 Microsoft Edge 浏览器开拓者大赛/","link":"","permalink":"http://example.com/2023/08/31/%E4%BA%A7%E5%93%81/20230413-%E8%BF%87%E4%BA%86%E4%B8%A4%E7%99%BE%E5%A4%A9%EF%BC%8C%E8%B0%88%E8%B0%88%20Microsoft%20Edge%20%E6%B5%8F%E8%A7%88%E5%99%A8%E5%BC%80%E6%8B%93%E8%80%85%E5%A4%A7%E8%B5%9B/","excerpt":"","text":"为什么要谈谈这个比赛作为一个独立参赛选手，我有幸获得了本比赛的第三名（当然全靠运气，不过也不乏一些方法论）。比赛的奖品嘛，我本来比较看重他的微软实习机会。不过猜测是互联网寒冬的原因，完全没有后续了，没人联系我实习的事情，后续去询问了对接比赛的工作人员、在群里咨询也没有任何情况。 获奖情况三等奖，就是第三名，奖金 5000 税后 4000，还有一堆实物奖品。还有一个挺好看的玻璃制奖杯。然后就去请室友吃自助餐了。 送来的快递有这么大，路上一个人搬回寝室累死了。 不知道是 11.4 公斤还是 11.4 斤，11.4 斤应该不会搬的我累死吧？ 这个比赛是什么参赛者择长开发，以“后疫情时代的变化与挑战”大主题，聚焦“科技改善生活”、“赋能生产力提高”、“多元与包容”三类主题，开发创意小插件，帮助你我看见更大的世界。 这个比赛的官网 https://edgecontest.microsoft.com/index.html 目前已经不能访问了。其实我们从中可以猜测到这个比赛是 Edge 中国区团队为了丰富 Edge 浏览器的扩展生态而举办的。 一些比赛信息以下是比较简短且关键的信息，将有助于下面我对比赛的分析。 分析得出的方法论轻量级技术简单分析上面比赛信息内四个要求，作为一个技术混子，一眼就能看出什么？没有技术要求！比赛这种形式，在一定时间内需要完成一个项目，确实是非常难完成技术需求高的项目的。大家能发挥的技术都差不太多。我们就不需要把重心放在技术力上了。 产品能力实用性、易用性、美观性、创新性其实说的就是产品能力。那段时间前不久才开始培养产品能力，正好拿这个比赛试试手。而产品能力又恰好是在比赛里面实现弯道超车的能力。因为参加比赛的有很多都是技术型选手，我确实是比不过人家。 重综合能力除了产品本身，比赛还要求做 PPT，视频等等，而且产品产出与上架都能为产品加分。则需要行动力和营销能力了。平常喜欢看一些产品人的文章，能大概猜测到作为产品的评审员爱看什么，可以向着那个方向写一下。除此之外，毕竟是一个需要从规划到上线的项目，作为个人参赛，完全就是需要综合能力。 我的项目这个比赛是在提交截止前几天我才知道的，群友在群里提了一嘴，我才知道（非常感谢群友，不然完全不知道）。 我一想，几天了怎么参加？混吧！但又不能完全摆烂啊，得稍微分析一下，所以有了上一节的那些内容。不过当时也没这么细致的分析，只是简单看了官网然后凭本能做决策。 接下来介绍一下我的参赛项目和当时的一些思考。 Meteor New Tab 在此之前 小舒同学 当时遇到了几个问题 命名不够直白，难以瞬间理解名称含义，毕竟当时起名的时候天天看一些文学作品有文人意识在里面。 界面没有科技感，因为想打造一种舒适具有禅意的感觉。 为了让产品有精神力，用了一些比较任性的口号和宣传。不够直！ 产品设计没有满足简洁的需求，平铺这种布局形式并不能满足所有人的需求 当时的几个想法 英文名，更有科技感 界面设计更有科技感 产品名称更直白 口号更加直白，而不是传递理念 产品描述更加直白，而不是传递理念 项目总结总体来说，参赛项目主要基于小舒同学二次创作。针对不同市场，打造不同的产品形象，更有不同的风格气势。如今 Meteor 仍然还在维护，并朝着向小舒同学越来越远的方向发展。我希望这对孪生兄弟都各具特色。 全篇总结我认为我是非常幸运的，因为鲜有这样的比赛，评委有很多产品经理。此前我也体验过互联网+之类的比赛，感觉评委没有产品人的那种气息。我在“互联网+” 里面也是显得有点不适应，拿了个校奖就寄了。老师后来安慰我说是 PPT 没念好，答辩的时候没跟评委客气啥的。 这个比赛考察的方向刚好比较适合我，难得有这样的比赛，所以我是非常幸运的，也因为幸运作为个人参赛我才能拿到这样的结果。如果让我去参加什么算法比赛，可能是拿不到什么好结果的。我当然希望以后能有更多这类更加开放，更加百花齐放的比赛。不过我想我已经没机会了，我就要毕业了。回首校园生活，没什么精彩，如此平淡。","categories":[],"tags":[]},{"title":"","slug":"产品/20210308-关于音乐情绪分析的构想","date":"2023-08-31T14:00:13.914Z","updated":"2023-08-27T02:56:01.000Z","comments":true,"path":"2023/08/31/产品/20210308-关于音乐情绪分析的构想/","link":"","permalink":"http://example.com/2023/08/31/%E4%BA%A7%E5%93%81/20210308-%E5%85%B3%E4%BA%8E%E9%9F%B3%E4%B9%90%E6%83%85%E7%BB%AA%E5%88%86%E6%9E%90%E7%9A%84%E6%9E%84%E6%83%B3/","excerpt":"没了烟酒麻将棋牌，现代年轻人的消遣方式变得越来越少。听音乐作为一种重要的消遣方式已经被越来越多依赖。","text":"没了烟酒麻将棋牌，现代年轻人的消遣方式变得越来越少。听音乐作为一种重要的消遣方式已经被越来越多依赖。 我们听音乐首先听的是音乐的情绪，不仅仅是音乐，绝大多数艺术作品也是富含情感在内的。听音乐的我们有时候需要找到对应情绪的音乐配合一些场景和自己的心情。但是音乐目前除了主要的原名称检索方式似乎再无其他方式。作为一个歌单日益庞大的普通用户，我觉得一个音乐应该需要更多的检索信息来配合音乐检索。比如音乐情绪。 用户痛点分析 一个喜欢听歌的人，经过多年的听歌岁月，必然会导致歌单曲目庞大臃肿，比如说我自己就收藏了2k首音乐。 而且音乐很多音乐的名称并不是中文，可能是各种各样的语言，甚至是符号。在我们需要找到某首曾听过的音乐时，我们可能只能用眼睛遍历所有歌单（我就经常干这种事情）而且最后还找不到想找的音乐。 视频创作者如果需要在视频中引用自己常听的音乐，仅仅通过模糊的印象寻找也是非常困难的事情，可能有时候怎么找就是找不到配合那个气氛的音乐。 可能用户群体 重度音乐爱好者。醒来，听音乐，下班，听音乐，运动，听音乐，睡觉，听音乐。对音乐进行情绪分析能有效的给用户提供音乐适用场景的信息。 视频创作者。需要配合场面气氛配乐。 混音师。混音师当然也需要用音乐配合气氛。 普通人。所有人都想要好的气氛情绪。 已有的类似案例网易云音乐中的歌单助手不知道他是什么方法分的，分的不细，情绪精确度不大，用处不大。 QQ音乐智能歌单这个还行，有乐器分析，大致的情感分析，不过感觉好像也不是很精确。 可能的实现方式基于音乐本身分析现在确实AI之类的东西很强，对音乐进行分析也不是不行。不过大概率是不准确的，现在，我并不认为AI能够很好的感受到艺术作品中的情绪与感情。 基于音乐的评论我觉得这个方法是大部分人都没想到的。就目前来说，AI对于语言的情感分析能力要比分析音乐本身的情感是要强的。而且对于文字的情感分析貌似已经有不少现成的服务了。以前我就曾看到过 DIYgod 用过文字的情绪分析服务。 关于音乐其他信息的获取音乐的乐器和种类应该是比较好分析的。不行还可以爬爬 MOO音乐。","categories":[],"tags":[]},{"title":"谈谈参加DCASE比赛时的感想","slug":"产品/20230901-谈谈参加DCASE比赛时的感想","date":"2023-08-31T14:00:13.913Z","updated":"2023-09-01T14:24:59.382Z","comments":true,"path":"2023/08/31/产品/20230901-谈谈参加DCASE比赛时的感想/","link":"","permalink":"http://example.com/2023/08/31/%E4%BA%A7%E5%93%81/20230901-%E8%B0%88%E8%B0%88%E5%8F%82%E5%8A%A0DCASE%E6%AF%94%E8%B5%9B%E6%97%B6%E7%9A%84%E6%84%9F%E6%83%B3/","excerpt":"DCASE比赛没有奖状或奖品，只有一个网页端的全球排名，这个比赛在声学领域有着重要影响力。作为一个第一次参加国际赛事的新手，我有幸获得了本比赛的第六名（团队的支持与努力也非常重要）。","text":"DCASE比赛没有奖状或奖品，只有一个网页端的全球排名，这个比赛在声学领域有着重要影响力。作为一个第一次参加国际赛事的新手，我有幸获得了本比赛的第六名（团队的支持与努力也非常重要）。 我比较看重这个比赛在声学领域的重要影响力，或许好的排名可以对毕业时找工作有帮助。然而，找工作那年互联网寒冬来袭，我的简历仿佛沉入无尽的深海，回想当时一遍一遍改着简历，觉得可笑又无力， 功能说明对不同人名使用不同颜色进行染色。以辅助记忆人物角色，人物颜色需要从一开始就固定，且每个人物的颜色都得不同。 代码链接：https://github.com/weiyuming1/wym_dcase2022_task2 也可以用不同的底色来达到染色的目的。 灵感来源日本动漫，作为一个脸盲的人。角色几乎是分不清的，不是看衣服，就是看颜色。有些番剧就用给每个角色赋予不同的发色，以此来达到区分人物角色的目的。这种区分非常有用。 为何想到此功能读《史蒂夫 · 乔布斯传》读到后面发现我一直都在往前翻人物介绍目录，除了一直都有戏份的人物，其他人物几乎就记不住，直译过来的人名太难记了。 所以就在晚上睡觉之前想了想怎么解决这个问题。 于是乎，这个功能就出来了。 不过我没写编码部分。 可能实现方案现有的算法貌似还挺多的，应该有那种在文章中分析出人名的算法。 把每个人名提取出来，分别从一开始就定义好每个人物的颜色，然后在文章中都是用这一种颜色固定不变。 可能问题一个人物可能在文章中可能以全称或部分名称出现，甚至可能是小名，这可能就需要用户来区分了，也可以大胆期待一下未来的 AI 。","categories":[],"tags":[]},{"title":"My New Post","slug":"My-New-Post","date":"2023-08-31T12:21:25.000Z","updated":"2023-08-31T12:22:28.549Z","comments":true,"path":"2023/08/31/My-New-Post/","link":"","permalink":"http://example.com/2023/08/31/My-New-Post/","excerpt":"","text":"哈哈哈啊哈哈哈哈","categories":[],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2023-08-31T12:11:28.181Z","updated":"2023-08-31T12:11:28.181Z","comments":true,"path":"2023/08/31/hello-world/","link":"","permalink":"http://example.com/2023/08/31/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]},{"title":"一个关于第三方购物平台的产品设计","slug":"产品/一个关于第三方购物平台的产品设计","date":"2020-10-03T09:42:00.000Z","updated":"2023-08-27T02:56:01.000Z","comments":true,"path":"2020/10/03/产品/一个关于第三方购物平台的产品设计/","link":"","permalink":"http://example.com/2020/10/03/%E4%BA%A7%E5%93%81/%E4%B8%80%E4%B8%AA%E5%85%B3%E4%BA%8E%E7%AC%AC%E4%B8%89%E6%96%B9%E8%B4%AD%E7%89%A9%E5%B9%B3%E5%8F%B0%E7%9A%84%E4%BA%A7%E5%93%81%E8%AE%BE%E8%AE%A1/","excerpt":"疫情期间选口罩想的一个购物产品功能","text":"疫情期间选口罩想的一个购物产品功能 计算单个价格方便比价 检验报告，自动获取生产标准的功能主要是为了证明商品的安全性。","categories":[],"tags":[]}],"categories":[],"tags":[]}